//==============================================
//
//ライフ(Life.cpp)
//Author: fujiwara ryuki
//
//==============================================
#include"main.h"
#include"manager.h"
#include"renderer.h"
#include"input.h"
#include"gauge.h"
#include"texture.h"
#include"player.h"

//****************//
//   マクロ定義   //
//****************//
#define GAUGE_POS		(D3DXVECTOR3(170.0f,130.0f, 0.0f))		//位置の初期値
#define GAUGE			(D3DXVECTOR3(150.0f,20.0f,0.0f))		//位置の初期値
#define MAX_GAUGE		(3)										//ゲージ値の初期値

//==============================================
//コンストラクタ
//==============================================
CGauge::CGauge()
{
	m_nGauge = GAUGE;
	m_nGaugeTemp = m_nGauge;
}
//==============================================
//デスストラクタ
//==============================================
CGauge::~CGauge()
{

}
//==============================================
//ライフの初期化処理
//==============================================
HRESULT CGauge::Init(void)
{
	//初期化処理
	CUI::Init();

	return S_OK;
}
//==============================================
//ライフの終了処理
//==============================================
void CGauge::Uninit(void)
{
	//終了処理
	CUI::Uninit();
}
//==============================================
//ライフの更新処理
//==============================================
void CGauge::Update(void)
{
	
}
//==============================================
//ライフの描画処理
//==============================================
void CGauge::Draw(void)
{
	//描画処理
	CUI::Draw();
}